In [5]:
import pandas as pd
data={"AT1":[9,10,8,8,9,10],"AT2":[10,8,9,7,5,9],"AT3":[9,8,7,10,8,7],"AT4":[10,8,9,7,10,9],"MID1":[13,14,15,11,12,10],"MID2":[15,15,13,14,13,12]}
df=pd.DataFrame(data,index=["rakshi","sri","pandu","meghaana","cherry","gayi"])
df

          AT1  AT2  AT3  AT4  MID1  MID2
rakshi      9   10    9   10    13    15
sri        10    8    8    8    14    15
pandu       8    9    7    9    15    13
meghaana    8    7   10    7    11    14
cherry      9    5    8   10    12    13
gayi       10    9    7    9    10    12

In [19]:
#operations on entire data
#sum
df.sum(axis=1)

rakshi      66
sri         63
pandu       61
meghaana    57
cherry      57
gayi        57
dtype: int64

In [7]:
df.sum(axis=0)

AT1     54
AT2     48
AT3     49
AT4     53
MID1    75
MID2    82
dtype: int64

In [8]:
#mean
df.mean(axis=1)

rakshi      11.000000
sri         10.500000
pandu       10.166667
meghaana     9.500000
cherry       9.500000
gayi         9.500000
dtype: float64

In [11]:
df.mean()

AT1      9.000000
AT2      8.000000
AT3      8.166667
AT4      8.833333
MID1    12.500000
MID2    13.666667
dtype: float64

In [12]:
df.min(axis=1)

rakshi      9
sri         8
pandu       7
meghaana    7
cherry      5
gayi        7
dtype: int64

In [14]:
#max
df.max(axis=1)

rakshi      15
sri         15
pandu       15
meghaana    14
cherry      13
gayi        12
dtype: int64

In [15]:
#median
df.median(axis=1)

rakshi      10.0
sri          9.0
pandu        9.0
meghaana     9.0
cherry       9.5
gayi         9.5
dtype: float64

In [16]:
#mode
df.mode(axis=1)

            0     1    2     3     4     5
rakshi    9.0  10.0  NaN   NaN   NaN   NaN
sri       8.0   NaN  NaN   NaN   NaN   NaN
pandu     9.0   NaN  NaN   NaN   NaN   NaN
meghaana  7.0   NaN  NaN   NaN   NaN   NaN
cherry    5.0   8.0  9.0  10.0  12.0  13.0
gayi      9.0  10.0  NaN   NaN   NaN   NaN

In [17]:
#standared deviation
df.std(axis=1)

rakshi      2.449490
sri         3.209361
pandu       3.125167
meghaana    2.738613
cherry      2.880972
gayi        1.643168
dtype: float64

In [18]:
#variance
df.var(axis=1)

rakshi       6.000000
sri         10.300000
pandu        9.766667
meghaana     7.500000
cherry       8.300000
gayi         2.700000
dtype: float64

In [20]:
#operations on individual cols
#sum
df.sum()

AT1     54
AT2     48
AT3     49
AT4     53
MID1    75
MID2    82
dtype: int64

In [21]:
#min
df.min()

AT1      8
AT2      5
AT3      7
AT4      7
MID1    10
MID2    12
dtype: int64

In [22]:
#max
df.max()

AT1     10
AT2     10
AT3     10
AT4     10
MID1    15
MID2    15
dtype: int64

In [23]:
#mean
df.mean()

AT1      9.000000
AT2      8.000000
AT3      8.166667
AT4      8.833333
MID1    12.500000
MID2    13.666667
dtype: float64

In [24]:
#mode
df.mode()

    AT1  AT2  AT3   AT4  MID1  MID2
0   8.0  9.0  7.0   9.0    10  13.0
1   9.0  NaN  8.0  10.0    11  15.0
2  10.0  NaN  NaN   NaN    12   NaN
3   NaN  NaN  NaN   NaN    13   NaN
4   NaN  NaN  NaN   NaN    14   NaN
5   NaN  NaN  NaN   NaN    15   NaN

In [25]:
#variance
df.var()

AT1     0.800000
AT2     3.200000
AT3     1.366667
AT4     1.366667
MID1    3.500000
MID2    1.466667
dtype: float64

In [26]:
#standared deviation
df.std()

AT1     0.894427
AT2     1.788854
AT3     1.169045
AT4     1.169045
MID1    1.870829
MID2    1.211060
dtype: float64

In [27]:
#describe
df.describe()

             AT1        AT2        AT3        AT4       MID1       MID2
count   6.000000   6.000000   6.000000   6.000000   6.000000   6.000000
mean    9.000000   8.000000   8.166667   8.833333  12.500000  13.666667
std     0.894427   1.788854   1.169045   1.169045   1.870829   1.211060
min     8.000000   5.000000   7.000000   7.000000  10.000000  12.000000
25%     8.250000   7.250000   7.250000   8.250000  11.250000  13.000000
50%     9.000000   8.500000   8.000000   9.000000  12.500000  13.500000
75%     9.750000   9.000000   8.750000   9.750000  13.750000  14.750000
max    10.000000  10.000000  10.000000  10.000000  15.000000  15.000000

In [30]:
#expoting file
df.to_excel("/home/rguktrkvalley/Desktop/labd.xlsx")

In [31]:
#grouping

In [33]:
import pandas as pd
df=pd.DataFrame({"NAME":["rakshi","sri","pandu","gayi","megh"],"marks":[90,92,95,99,91],"dept":["CSE","ECE","ECE","CIVIL","CSE"],"gender":["f","m","m","f","f"]})
df

     NAME  marks   dept gender
0  rakshi     90    CSE      f
1     sri     92    ECE      m
2   pandu     95    ECE      m
3    gayi     99  CIVIL      f
4    megh     91    CSE      f

In [38]:
#grouping
g=df.groupby("dept")
g.first()

         NAME  marks gender
dept
CIVIL    gayi     99      f
CSE    rakshi     90      f
ECE       sri     92      m

In [39]:
#operarions
#size of each group
g.size()

dept
CIVIL    1
CSE      2
ECE      2
dtype: int64

In [42]:
g.get_group("CSE")

     NAME  marks dept gender
0  rakshi     90  CSE      f
4    megh     91  CSE      f

In [43]:
#aggrigate functions
g.agg("sum")

             NAME  marks gender
dept
CIVIL        gayi     99      f
CSE    rakshimegh    181     ff
ECE      sripandu    187     mm

In [45]:
g.agg(["sum","min"])

             NAME        marks     gender
              sum    min   sum min    sum min
dept
CIVIL        gayi   gayi    99  99      f   f
CSE    rakshimegh   megh   181  90     ff   f
ECE      sripandu  pandu   187  92     mm   m

In [46]:
#correlation
import pandas as pd
data={"feature1":[1,2,3,4,5],
     "feature2":[5,4,3,2,1],
     "feature3":[3,1,5,4,2]}
df=pd.DataFrame(data)
df.corr()

          feature1  feature2  feature3
feature1       1.0      -1.0       0.1
feature2      -1.0       1.0      -0.1
feature3       0.1      -0.1       1.0